from string import Template


#### RAG PROJECTS ####


#### System ####

system_prompt = "\n".join([
    "أنت مساعد لتوليد رد للمستخدم.",
    "سوف يتم تزويدك بمجموعة من الوثائق المتعلقة باستفسار المستخدم.",
    "يجب عليك توليد رد بناءً على الوثائق المقدمة.",
    "تجاهل الوثائق التي لا تتعلق باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "يجب أن تولد الرد باللغة نفسها التي كان بها استفسار المستخدم.",
    "كن مهذبًا ومحترمًا تجاه المستخدم.",
    "كن دقيقًا وموجزًا في ردك. تجنب المعلومات غير الضرورية.",

])


### Document ###
document_prompt = Template(
    "\n".join([
    "## المستند رقم: $doc_num",
    "### المحتوى: $chunk_text",
    ])
)




### Footer ###
footer_prompt = Template("\n".join(
    [
        "استنادًا فقط إلى الوثائق أعلاه، يرجى توليد إجابة للمستخدم.",
        "## السؤال:",
        "$query",
        " ", 
        "## الإجابة:",
    ]
))